tap 'appsketch/dafont'
tap 'argon/mas'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'mpv-player/mpv'
brew 'autoconf'
brew 'automake'
brew 'libpng'
brew 'freetype'
brew 'pkg-config'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'sphinx-doc'
brew 'cmake'
brew 'coreutils'
brew 'makedepend'
brew 'openssl'
brew 'rtmpdump'
brew 'curl'
brew 'node'
brew 'diff-so-fancy'
brew 'docutils'
brew 'duti'
brew 'faac'
brew 'lame'
brew 'fribidi'
brew 'git'
brew 'gobject-introspection'
brew 'icu4c'
brew 'harfbuzz'
brew 'yasm'
brew 'libass'
brew 'libogg'
brew 'flac'
brew 'libtool'
brew 'libvorbis'
brew 'libsndfile'
brew 'libbs2b'
brew 'jpeg'
brew 'xz'
brew 'libtiff'
brew 'leptonica'
brew 'tesseract'
brew 'texi2html'
brew 'theora'
brew 'x264'
brew 'x265'
brew 'xvid'
brew 'zimg'
brew 'ffmpeg'
brew 'gdbm'
brew 'grc'
brew 'libarchive'
brew 'libdvdcss'
brew 'libdvdread'
brew 'little-cms2'
brew 'lua'
brew 'mackup'
brew 'readline'
brew 'sqlite'
brew 'python3'
brew 'vapoursynth'
brew 'youtube-dl'
brew 'mpv', args: ['with-bundle', 'with-libarchive', 'with-vapoursynth']
brew 'nvm'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'argon/mas/mas'
cask 'atom'
cask 'cheatsheet'
cask 'dafont-flottflott'
cask 'dropbox'
cask 'epubquicklook'
cask 'etrecheck'
cask 'flux'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-open-sans'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-sans-pro'
cask 'google-chrome-canary'
cask 'imageoptim'
cask 'keepingyouawake'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicknfo'
cask 'silverlight'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'transmit'
cask 'webpquicklook'
cask 'yemuzip'
cask 'ynab'
mas 'Tweetbot (2.4.4)', id: 557168941
mas 'Chatty (2.0.1)', id: 981117463
mas '1Password (6.3.5)', id: 443987910
mas 'Paste (2.0.1)', id: 967805235
mas 'ReadKit (2.4.3)', id: 588726889
mas 'Pages (6.0)', id: 409201541
mas 'Keynote (7.0)', id: 409183694
mas 'Numbers (4.0)', id: 409203825
