tap "aerobounce/tap"
tap "azure/functions"
tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "epk/epk"
tap "felixkratz/formulae"
tap "homebrew/command-not-found"
tap "isen-ng/dotnet-sdk-versions"
tap "lihaoyun6/tap"
tap "nikitabobko/tap"
tap "rien7/apps"
tap "smudge/smudge"
tap "viva64/pvs-studio"
tap "warrensbox/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# Library for command-line editing
brew "readline"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Multi-shell multi-command argument completer
brew "carapace"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Power of curl, ease of use of httpie
brew "curlie"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node", link: false
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simple terminal UI for search and replace
brew "serpl"
# HTTP regression testing and benchmarking utility
brew "siege"
# Command-line tool for Stripe
brew "stripe-cli"
# Opinionated Lua code formatter
brew "stylua"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Static analysis security scanner for your terraform code
brew "tfsec"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# User Defaults Plist → Shell Script converter with Regex filtering
brew "aerobounce/tap/ds"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# A CLI for configuring 'Night Shift' on macOS 🌕🌖🌗🌘🌑
brew "smudge/smudge/nightlight"
brew "viva64/pvs-studio/pvs-studio"
brew "viva64/pvs-studio/pvs-studio-dotnet"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application to indicate the aerospace workspace
cask "aeroindicator"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Get the battery level of all your devices on your Mac.
cask "airbattery"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Chromium based browser
cask "arc"
# Compare files and folders
cask "beyond-compare"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Trains AIs to understand and translate texts
cask "deepl"
# Translate words without ever opening a dictionary
cask "dictionaries"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk6"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk6-0-400"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk8"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk8-0-400"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk9"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk9-0-200"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk9-0-300"
# Find files, folders, or contents in any file
cask "easyfind"
# Change the behavior of the fn keys depending on the active application
cask "fluor"
cask "font-inter"
cask "font-sf-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualiser
cask "keycastr"
# Custom Discord client
cask "legcord"
# Open-source Dropbox client
cask "maestral"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Media player
cask "movist-pro"
# Replacement for Docker Desktop
cask "orbstack"
# Read/write support for NTFS formatted volumes
cask "paragon-ntfs"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Helper application for Things
cask "thingsmacsandboxhelper"
# Open-source BitTorrent client
cask "transmission"
# PKG software package uninstall tool
cask "uninstallpkg"
# Configurator of compatible keyboards in real time
cask "vial"
# Calling and messaging application focusing on security
cask "viber"
# Open-source code editor
cask "visual-studio-code"
# REST, GraphQL and gRPC client
cask "yaak"
mas "1Password for Safari", id: 1569813296
mas "Couverture", id: 1552415914
mas "Day One", id: 1055511498
mas "Finances", id: 1218241304
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "iPreview", id: 1519213509
mas "Keynote", id: 409183694
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SponsorBlock", id: 1573461917
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "Tomito", id: 1526042938
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "darkriszty.markdown-table-prettify"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "ghmcadams.lintlens"
vscode "github.vscode-github-actions"
vscode "hbenl.vscode-test-explorer"
vscode "ibm.output-colorizer"
vscode "jackfranklin.vscode-go-to-file"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode.test-adapter-converter"
vscode "pascalsenn.keyboard-quickfix"
vscode "pflannery.vscode-versionlens"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
