tap 'alehouse/unofficial'
tap 'appsketch/dafont'
tap 'argon/mas'
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'colindean/fonts-nonfree'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'mpv-player/mpv'
brew 'autoconf'
brew 'automake'
brew 'bison'
brew 'ghc'
brew 'cabal-install'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'cmake'
brew 'coreutils'
brew 'curl', args: ['with-openssl']
brew 'diff-so-fancy'
brew 'docutils'
brew 'duti'
brew 'lame'
brew 'git'
brew 'x264'
brew 'xvid'
brew 'ffmpeg', args: ['with-openssl']
brew 'flac'
brew 'fribidi'
brew 'gdbm'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'icu4c'
brew 'harfbuzz'
brew 'jpeg'
brew 'libtiff'
brew 'leptonica'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libaacs'
brew 'xz'
brew 'libarchive'
brew 'libass'
brew 'libdvdcss'
brew 'libdvdread'
brew 'libogg'
brew 'libsamplerate'
brew 'libvorbis'
brew 'libsndfile'
brew 'libtool'
brew 'little-cms2'
brew 'lua'
brew 'makedepend'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'python3'
brew 'youtube-dl', args: ['with-rtmpdump']
brew 'mpv', args: ['HEAD', 'with-bundle', 'with-libdvdread']
brew 'node'
brew 'nvm'
brew 'rtmpdump'
brew 'sphinx-doc'
brew 'tesseract'
brew 'texi2html'
brew 'zimg'
brew 'vapoursynth'
brew 'yasm'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'argon/mas/mas'
brew 'homebrew/dupes/grep', args: ['with-default-names']
cask 'appcleaner'
cask 'atom'
cask 'cheatsheet'
cask 'coconutbattery'
cask 'dropbox'
cask 'epubquicklook'
cask 'etrecheck'
cask 'flash-npapi'
cask 'flux'
cask 'font-droid-serif'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-microsoft-office'
cask 'font-open-sans'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-sans-pro'
cask 'google-chrome-canary'
cask 'ifilex'
cask 'imageoptim'
cask 'keepingyouawake'
cask 'monolingual'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicknfo'
cask 'rdm'
cask 'silverlight'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'supaview'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'webpquicklook'
cask 'yemuzip'
cask 'ynab'
mas 'Tweetbot', id: 557168941
mas 'Flume', id: 792425898
mas 'Chatty', id: 981117463
mas '1Password', id: 443987910
mas 'Paste', id: 967805235
mas 'ReadKit', id: 588726889
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Milkeddit', id: 1109711745
mas 'Numbers', id: 409203825
